package com.example.lenovo.kuaikan.home.comicdetails.model.data;

import java.util.List;

/**
 * Created by Zhanglibin on 2017/4/16.
 */

public class ComicCommentBean {

    /**
     * code : 200
     * data : {"total":10,"reviews":[{"likes_count":913,"review_id":84078215201140736,"created_at":1484636916706,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160828/3uq21lsf1.webp-w180.w","grade":0,"nickname":"流萤z","reg_type":"phone","id":9376546},"content":"发生在她身上的一次窘迫，意外唤醒了他穿越时空的能力。本是冷漠孤僻的他渐渐将目光转向了她\u2014\u2014那个命中注定的人，也由此展开了一段穿越之旅。然而做任何事都是要付出一定代价的，为了守护冒失的她，他不惜耗费自己的生命去换她岁月静好，却始终说不出心底的爱恋。但是我相信，她一定能察觉得到，即使他被人所遗忘，她仍会记得他，记得那无声的守护。","status":1,"is_liked":false},{"likes_count":713,"review_id":78098808913375232,"created_at":1483211315155,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160609/hw02jbles.webp-w180.w","grade":0,"nickname":"此岸叶落_ts","reg_type":"qq","id":14277542},"content":"刚开始看序章的时候真的是被感动了，原来世界上还会有那么一个默默守护着你的人，即使最后没能在一起，可那却是一生中最宝贵的回忆，就算是忘掉所有也不会忘记与你有关的那段回忆，因为看见序章就知道结局肯定是虐的，但还是会忍不住追，所以希望大大结局之后写点番外吧，这一世不行那就等下一世好了，","status":1,"is_liked":false},{"likes_count":550,"review_id":84819394725273600,"created_at":1484813627675,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170119/1ex9y1iw2.webp-w180.w","grade":0,"nickname":"夜枫殇","reg_type":"qq","id":30822430},"content":"冷漠孤僻的他，为了守护懵懵懂懂冒冒失失的她，为她一次次地穿越过去，为她去掉遗憾。他纵使知道一次次的穿越会浪费生命，但他还是愿意为了她，一次次穿越回过去。虽不曾说出留在心底的爱，但是我想她一定会察觉，他一直在守护着她。","status":1,"is_liked":false},{"likes_count":151,"review_id":210831778720514320,"created_at":1489724214661,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170315/4cp83bng9.webp-w180.w","grade":0,"nickname":"寻一个叶落归根处","reg_type":"qq","id":19760175},"content":"孤僻如他，内心深处里的温柔只为冒失的她绽放，交错的时光里，一次次的奋不顾身却只是默默无言的护她安好，即使这样还是无法诉说心底的爱恋，希望男主付出的一切努力不白费，女主还是会记得有这么一个人来过她的世界，在她的青春里默默守护的人吧","status":1,"is_liked":false},{"likes_count":162,"review_id":206002885987664144,"created_at":1489148565789,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170122/fn24bor2t.webp-w180.w","grade":0,"nickname":"暗夜精灵_dr","reg_type":"qq","id":31269801},"content":"一次次不惜代价的守护，一点点朦胧生起的爱恋，一段段奇幻的时光穿越，交织成刻骨铭心的记忆。\n我爱你，所以默默守护你\n我爱你，所以永远记住你\n\u201c我愿意用我的一切，换你一世繁华\u201d\n  这样的故事，凄苦而悲伤，深刻而耐人寻味，教会人珍惜一切，永远不要做让自己后悔的决定。\n  所以这样的故事，即使在悲伤也永远都是美丽的\u2026\u2026","status":1,"is_liked":false},{"likes_count":301,"review_id":85234460259889152,"created_at":1484912587010,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170227/2kro6n64y.webp-w180.w","grade":0,"nickname":"Flower末初花","reg_type":"phone","id":29988165},"content":"愿失去所有生命，只愿看你一眼！\n他，愿失去自己的生命，抹去她生命中的遗憾，明知自己会死去，可是为了她不顾一切，一定要抹去她的遗憾，时时出现在她面前，可从来不说出\u201c我爱你\u201d的三个字！\n她，是一个懵懂的女孩，他爱着她，为了那个懵懂的女孩，失去了自己的生命！\n虽然，为了那个女孩，不让女孩在生命中留下遗憾，他失去了自己的生命，但从不让那个女孩知道，也从不说爱你\u2026\u2026\u2026\u2026\u2026\u2026","status":1,"is_liked":false},{"likes_count":382,"review_id":90640047797800960,"created_at":1486201379510,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170204/xifkqxlkn.webp-w180.w","grade":0,"nickname":"最爱写漫评的智障喵糖欢乐多","reg_type":"weibo","id":9365336},"content":"［耗尽生命只是为了你］\n时光，和它的守护者，这是这部漫画的［主题］在漫画里面，梨音也许就是［时光］，而阿透其实就是梨音的守护者。为了梨音的心愿，阿透一次次用自己的寿命为她穿越时间。这是什么？这不是单纯的帮助，也不是因为阿透是梨音的守护者要守护她才这样。这是因为，阿透，是爱着梨音的。如果你遇上爱情，你会不会奋不顾身为对方付出？你会不会因为别人生病而\n忙上忙下？\n\n爱是付出，你知道为什么你的另一半嘴里和你吵架一边还在满足你的愿望？你知道为什么他们对你是刀子嘴豆腐心？\n\n因为这是爱情啊。","status":1,"is_liked":false},{"likes_count":133,"review_id":80428810900189184,"created_at":1483766830918,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160910/5yn9dd009.webp-w180.w","grade":0,"nickname":"霧雨霞","reg_type":"qq","id":22570732},"content":"雪梨大大笔下的人物很美好，也很真实。总之炒鸡爱看！\n这场奇幻的爱情，时空的交错，他和她，邻居男， 音梨。一个帅气的外表冷酷的内心细腻温柔的他，一个马虎大意关爱小动物的她。在这一刻，相遇了。\n要守护好她啊，邻居男，别让音梨伤心，她可是你一辈子都要好好疼爱默默守护的人呢。\n雪梨大大啊，结局不要虐！\n","status":1,"is_liked":false},{"likes_count":306,"review_id":77656091364265984,"created_at":1483105763066,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170130/uqca8a5ej.webp-w180.w","grade":0,"nickname":"幽邃月","reg_type":"qq","id":11688453},"content":"时光是个好东西\n它能体现一个人有多爱你\n时光是个坏家伙\n它偷走了我们最美好的回忆\n时光，要是有人要保留那珍贵的回忆\n给她，代价，我来承担\n时光里有我们羞涩的青春\n时光里有我们年少的轻狂\n如果有幸，那我来守，\n时光守护人","status":1,"is_liked":false},{"likes_count":201,"review_id":78043699068121088,"created_at":1483198175944,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170409/zVkKe9bNw.webp-w180.w","grade":0,"nickname":"郭小狮","reg_type":"phone","id":17070711},"content":"我感觉这个漫画很感人，和其他的少女漫画不一样，感觉更有趣，作者大大也有丰富的想象力，他们之间有误会，有快乐，有痛苦，但这就是青春，我们的青春之所以美丽，是因为我们敢勇于向前。这个漫画之所以感人，那应该就是爱的力量吧，正因为有了爱，世界才会精彩，不会冷冰冰，所以有爱的漫画可以治愈，爱胜过一切。\n\n\n\n\n\n\n\n\n\n\n在这里祝各位元旦快乐🎉","status":1,"is_liked":false}],"since":-1}
     * message : ok
     */

    private int code;
    private DataBean data;
    private String message;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public static class DataBean {
        /**
         * total : 10
         * reviews : [{"likes_count":913,"review_id":84078215201140736,"created_at":1484636916706,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160828/3uq21lsf1.webp-w180.w","grade":0,"nickname":"流萤z","reg_type":"phone","id":9376546},"content":"发生在她身上的一次窘迫，意外唤醒了他穿越时空的能力。本是冷漠孤僻的他渐渐将目光转向了她\u2014\u2014那个命中注定的人，也由此展开了一段穿越之旅。然而做任何事都是要付出一定代价的，为了守护冒失的她，他不惜耗费自己的生命去换她岁月静好，却始终说不出心底的爱恋。但是我相信，她一定能察觉得到，即使他被人所遗忘，她仍会记得他，记得那无声的守护。","status":1,"is_liked":false},{"likes_count":713,"review_id":78098808913375232,"created_at":1483211315155,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160609/hw02jbles.webp-w180.w","grade":0,"nickname":"此岸叶落_ts","reg_type":"qq","id":14277542},"content":"刚开始看序章的时候真的是被感动了，原来世界上还会有那么一个默默守护着你的人，即使最后没能在一起，可那却是一生中最宝贵的回忆，就算是忘掉所有也不会忘记与你有关的那段回忆，因为看见序章就知道结局肯定是虐的，但还是会忍不住追，所以希望大大结局之后写点番外吧，这一世不行那就等下一世好了，","status":1,"is_liked":false},{"likes_count":550,"review_id":84819394725273600,"created_at":1484813627675,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170119/1ex9y1iw2.webp-w180.w","grade":0,"nickname":"夜枫殇","reg_type":"qq","id":30822430},"content":"冷漠孤僻的他，为了守护懵懵懂懂冒冒失失的她，为她一次次地穿越过去，为她去掉遗憾。他纵使知道一次次的穿越会浪费生命，但他还是愿意为了她，一次次穿越回过去。虽不曾说出留在心底的爱，但是我想她一定会察觉，他一直在守护着她。","status":1,"is_liked":false},{"likes_count":151,"review_id":210831778720514320,"created_at":1489724214661,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170315/4cp83bng9.webp-w180.w","grade":0,"nickname":"寻一个叶落归根处","reg_type":"qq","id":19760175},"content":"孤僻如他，内心深处里的温柔只为冒失的她绽放，交错的时光里，一次次的奋不顾身却只是默默无言的护她安好，即使这样还是无法诉说心底的爱恋，希望男主付出的一切努力不白费，女主还是会记得有这么一个人来过她的世界，在她的青春里默默守护的人吧","status":1,"is_liked":false},{"likes_count":162,"review_id":206002885987664144,"created_at":1489148565789,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170122/fn24bor2t.webp-w180.w","grade":0,"nickname":"暗夜精灵_dr","reg_type":"qq","id":31269801},"content":"一次次不惜代价的守护，一点点朦胧生起的爱恋，一段段奇幻的时光穿越，交织成刻骨铭心的记忆。\n我爱你，所以默默守护你\n我爱你，所以永远记住你\n\u201c我愿意用我的一切，换你一世繁华\u201d\n  这样的故事，凄苦而悲伤，深刻而耐人寻味，教会人珍惜一切，永远不要做让自己后悔的决定。\n  所以这样的故事，即使在悲伤也永远都是美丽的\u2026\u2026","status":1,"is_liked":false},{"likes_count":301,"review_id":85234460259889152,"created_at":1484912587010,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170227/2kro6n64y.webp-w180.w","grade":0,"nickname":"Flower末初花","reg_type":"phone","id":29988165},"content":"愿失去所有生命，只愿看你一眼！\n他，愿失去自己的生命，抹去她生命中的遗憾，明知自己会死去，可是为了她不顾一切，一定要抹去她的遗憾，时时出现在她面前，可从来不说出\u201c我爱你\u201d的三个字！\n她，是一个懵懂的女孩，他爱着她，为了那个懵懂的女孩，失去了自己的生命！\n虽然，为了那个女孩，不让女孩在生命中留下遗憾，他失去了自己的生命，但从不让那个女孩知道，也从不说爱你\u2026\u2026\u2026\u2026\u2026\u2026","status":1,"is_liked":false},{"likes_count":382,"review_id":90640047797800960,"created_at":1486201379510,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170204/xifkqxlkn.webp-w180.w","grade":0,"nickname":"最爱写漫评的智障喵糖欢乐多","reg_type":"weibo","id":9365336},"content":"［耗尽生命只是为了你］\n时光，和它的守护者，这是这部漫画的［主题］在漫画里面，梨音也许就是［时光］，而阿透其实就是梨音的守护者。为了梨音的心愿，阿透一次次用自己的寿命为她穿越时间。这是什么？这不是单纯的帮助，也不是因为阿透是梨音的守护者要守护她才这样。这是因为，阿透，是爱着梨音的。如果你遇上爱情，你会不会奋不顾身为对方付出？你会不会因为别人生病而\n忙上忙下？\n\n爱是付出，你知道为什么你的另一半嘴里和你吵架一边还在满足你的愿望？你知道为什么他们对你是刀子嘴豆腐心？\n\n因为这是爱情啊。","status":1,"is_liked":false},{"likes_count":133,"review_id":80428810900189184,"created_at":1483766830918,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160910/5yn9dd009.webp-w180.w","grade":0,"nickname":"霧雨霞","reg_type":"qq","id":22570732},"content":"雪梨大大笔下的人物很美好，也很真实。总之炒鸡爱看！\n这场奇幻的爱情，时空的交错，他和她，邻居男， 音梨。一个帅气的外表冷酷的内心细腻温柔的他，一个马虎大意关爱小动物的她。在这一刻，相遇了。\n要守护好她啊，邻居男，别让音梨伤心，她可是你一辈子都要好好疼爱默默守护的人呢。\n雪梨大大啊，结局不要虐！\n","status":1,"is_liked":false},{"likes_count":306,"review_id":77656091364265984,"created_at":1483105763066,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170130/uqca8a5ej.webp-w180.w","grade":0,"nickname":"幽邃月","reg_type":"qq","id":11688453},"content":"时光是个好东西\n它能体现一个人有多爱你\n时光是个坏家伙\n它偷走了我们最美好的回忆\n时光，要是有人要保留那珍贵的回忆\n给她，代价，我来承担\n时光里有我们羞涩的青春\n时光里有我们年少的轻狂\n如果有幸，那我来守，\n时光守护人","status":1,"is_liked":false},{"likes_count":201,"review_id":78043699068121088,"created_at":1483198175944,"topic_id":908,"user":{"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/170409/zVkKe9bNw.webp-w180.w","grade":0,"nickname":"郭小狮","reg_type":"phone","id":17070711},"content":"我感觉这个漫画很感人，和其他的少女漫画不一样，感觉更有趣，作者大大也有丰富的想象力，他们之间有误会，有快乐，有痛苦，但这就是青春，我们的青春之所以美丽，是因为我们敢勇于向前。这个漫画之所以感人，那应该就是爱的力量吧，正因为有了爱，世界才会精彩，不会冷冰冰，所以有爱的漫画可以治愈，爱胜过一切。\n\n\n\n\n\n\n\n\n\n\n在这里祝各位元旦快乐🎉","status":1,"is_liked":false}]
         * since : -1
         */

        private int total;
        private int since;
        private List<ReviewsBean> reviews;

        public int getTotal() {
            return total;
        }

        public void setTotal(int total) {
            this.total = total;
        }

        public int getSince() {
            return since;
        }

        public void setSince(int since) {
            this.since = since;
        }

        public List<ReviewsBean> getReviews() {
            return reviews;
        }

        public void setReviews(List<ReviewsBean> reviews) {
            this.reviews = reviews;
        }

        public static class ReviewsBean {
            /**
             * likes_count : 913
             * review_id : 84078215201140736
             * created_at : 1484636916706
             * topic_id : 908
             * user : {"pub_feed":0,"avatar_url":"http://f2.kkmh.com/image/160828/3uq21lsf1.webp-w180.w","grade":0,"nickname":"流萤z","reg_type":"phone","id":9376546}
             * content : 发生在她身上的一次窘迫，意外唤醒了他穿越时空的能力。本是冷漠孤僻的他渐渐将目光转向了她——那个命中注定的人，也由此展开了一段穿越之旅。然而做任何事都是要付出一定代价的，为了守护冒失的她，他不惜耗费自己的生命去换她岁月静好，却始终说不出心底的爱恋。但是我相信，她一定能察觉得到，即使他被人所遗忘，她仍会记得他，记得那无声的守护。
             * status : 1
             * is_liked : false
             */

            private int likes_count;
            private long review_id;
            private long created_at;
            private int topic_id;
            private UserBean user;
            private String content;
            private int status;
            private boolean is_liked;

            public int getLikes_count() {
                return likes_count;
            }

            public void setLikes_count(int likes_count) {
                this.likes_count = likes_count;
            }

            public long getReview_id() {
                return review_id;
            }

            public void setReview_id(long review_id) {
                this.review_id = review_id;
            }

            public long getCreated_at() {
                return created_at;
            }

            public void setCreated_at(long created_at) {
                this.created_at = created_at;
            }

            public int getTopic_id() {
                return topic_id;
            }

            public void setTopic_id(int topic_id) {
                this.topic_id = topic_id;
            }

            public UserBean getUser() {
                return user;
            }

            public void setUser(UserBean user) {
                this.user = user;
            }

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public int getStatus() {
                return status;
            }

            public void setStatus(int status) {
                this.status = status;
            }

            public boolean isIs_liked() {
                return is_liked;
            }

            public void setIs_liked(boolean is_liked) {
                this.is_liked = is_liked;
            }

            public static class UserBean {
                /**
                 * pub_feed : 0
                 * avatar_url : http://f2.kkmh.com/image/160828/3uq21lsf1.webp-w180.w
                 * grade : 0
                 * nickname : 流萤z
                 * reg_type : phone
                 * id : 9376546
                 */

                private int pub_feed;
                private String avatar_url;
                private int grade;
                private String nickname;
                private String reg_type;
                private int id;

                public int getPub_feed() {
                    return pub_feed;
                }

                public void setPub_feed(int pub_feed) {
                    this.pub_feed = pub_feed;
                }

                public String getAvatar_url() {
                    return avatar_url;
                }

                public void setAvatar_url(String avatar_url) {
                    this.avatar_url = avatar_url;
                }

                public int getGrade() {
                    return grade;
                }

                public void setGrade(int grade) {
                    this.grade = grade;
                }

                public String getNickname() {
                    return nickname;
                }

                public void setNickname(String nickname) {
                    this.nickname = nickname;
                }

                public String getReg_type() {
                    return reg_type;
                }

                public void setReg_type(String reg_type) {
                    this.reg_type = reg_type;
                }

                public int getId() {
                    return id;
                }

                public void setId(int id) {
                    this.id = id;
                }
            }
        }
    }
}
